# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

# *Пример:*

# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8 

# a = int(input("Введите число "))
# b = int(input("Введите степень числа(целое неотрицательно число) "))

# def func(a, b):
#     if b == 0:
#         return 1

#     return func(a, b - 1) * a


# print(func(a, b))


# Задача 28: Вводится десятичное число. Реализовать алгоритм его перевода в двоичную систему счисления через рекурсию. 
# Нельзя использовать функцию bin()

# *Пример:*
#     10
#     *Вывод:*
#     1010

# def binary(n):
#     if n == 0 or n == 1:
#         return f'{n}'
#     return binary(n // 2) + f'{n % 2}'

# n = int(input("Введите десятичное число: "))
# print(binary(n))
